{
    "index":
    {
        "name":"Marwan Akkari",
        "title":"développeur web front‑end en freelance"
    },
    "about":
    {
        "title":"Mon profil",
        "imageLink":"/about-img.jpg",
        "description":"Passionné de technologie et de création artistique, il fut tout naturel pour moi de me porter vers le développement, et plus particulièrement web, qui lie la technicité des langages de programmation avec les impératifs esthétiques des demandes. Au cours des dernières années, j'ai appris les languages du web tel que JavaScript, Jquery, React, PHP, ainsi que le C++ et le C#."
    },
    "project":
    {
        "title":"Mes projets",
        "hexword":
        {
            "title":"Hexword",
            "description":"Un jeu fait en HTML pur et réalisé en 2021 pour un devoir. L'énoncé était de choisir une couleur hexadécimale formant un mot, puis de faire un jeu autour du mot et de la couleur en question. Ma couleur était #D077ED (''Dotted'', pointillé en anglais) et j'ai crée un jeu incrémental où le but est d'atteindre 10 000 points le plus rapidement possible.",
            "imageLink":"",
            "projLink":""
        },
        "scalperShooter":
        {
            "title":"Scalper shooter",
            "description":"Un jeu fait à l'aide de la librairie JavaScript D3.js et réalisé en 2022 pour un devoir. L'énoncé était de faire un jeu où le joueur défend un endroit en tirant sur une vague d'ennemies arrivant vers lui. Dans Scalper shooter, le joueur doit détruire le plus de robots avant qu'ils ne volent 3 consoles, signant la fin de la partie.",
            "imageLink":"",
            "projLink":""
        },
        "cvVideo":
        {
            "title":"CV vidéo",
            "description":"Un CV vidéo en anglais réalisé en 2022 pour un devoir, dans lequel je parle de mon parcours professionel, de mes compétences, de mon stage chez CVR, et de mes moyens de contact.",
            "imageLink":"/cv-video-img.jpg",
            "projLink":"https://www.youtube.com/watch?v=f8m95hvMtoc"
        },
        "fallingShapes":
        {
            "title":"Falling shapes",
            "description":"Un jeu de plateforme et de puzzle réalisé lors de mon stage d'étude en 2021, le but est de jouer avec la physique pour amener la balle à la ligne d'arrivée.",
            "imageLink":"/falling-shapes-img.svg",
            "projLink":"https://ghatos.itch.io/falling-shapes"
        },
        "tacticalNounours":
        {
            "title":"Tactical nounours",
            "description":"Ma première mission de freelance, un site web fait avec React pour Tactical Nounours, un développeur indépendant de jeux-vidéo en réalité virtuelle.",
            "imageLink":"/tactical-nounours-img.svg",
            "projLink":"https://www.tacticalnounours.com/"
        },
        "depletime":
        {
            "title":"Depletime",
            "description":"Un jeu de plateforme en 2D réalisé en 2023 pour la Gamejam Advance. Les participants avaient 2 jours pour créer un jeu respectant le thème ''Pause''. J'ai donc crée Depletime où le joueur peut momentanément mettre le temps en pause afin de geler l'environnement sur place et de lui permettre de passer les niveaux.",
            "imageLink":"/depletime-img.svg",
            "projLink":"https://ghatos.itch.io/depletime"
        }
    },
    "contact":
    {
        "title":"Me contacter",
        "description":"Vous pouvez me contacter via les plateformes suivantes:"
    },
    "returnBtn":
    {
        "text":"Retour"
    }
}